let str = `Что такое JavaScript?
Ответ: JavaScript - это язык программирования, который используется для создания динамических веб-страниц и взаимодействия с пользователем.

Какие типы данных поддерживает JavaScript?
Ответ: JavaScript поддерживает примитивные типы данных, такие как число, строка, логический тип и null, а также объекты и массивы.

Как создать переменную в JavaScript?
Ответ: Для создания переменной в JavaScript используется ключевое слово var, let или const, за которым следует имя переменной и необязательное начальное значение. Например, var x = 10;
`
export default str
