let str = `Что такое JavaScript?
Ответ: JavaScript - это язык программирования, который используется для создания динамических веб-страниц и взаимодействия с пользователем.

Какие типы данных поддерживает JavaScript?
Ответ: JavaScript поддерживает примитивные типы данных, такие как число, строка, логический тип и null, а также объекты и массивы.

Как создать переменную в JavaScript?
Ответ: Для создания переменной в JavaScript используется ключевое слово var, let или const, за которым следует имя переменной и необязательное начальное значение. Например, var x = 10;

Что такое область видимости переменных в JavaScript?
Ответ: Область видимости переменных определяет, где в коде можно обратиться к переменной. В JavaScript есть два типа областей видимости: глобальная и локальная. Переменные, объявленные внутри функции, имеют локальную область видимости, а переменные, объявленные вне функции, имеют глобальную область видимости.

Какие операторы используются в JavaScript?
Ответ: В JavaScript используются операторы арифметические (+, -, *, /), сравнения (==, ===, !=, !==, >, <, >=, <=), логические (&&, ||, !) и другие.

Какие методы используются для работы со строками в JavaScript?
Ответ: В JavaScript для работы со строками используются методы, такие как slice(), substring(), substr(), concat(), split(), indexOf() и другие.

Что такое массив в JavaScript?
Ответ: Массив - это структура данных, которая может содержать несколько значений. В JavaScript массивы могут содержать значения любых типов данных и могут изменяться динамически.

Как добавить элемент в конец массива в JavaScript?
Ответ: Для добавления элемента в конец массива в JavaScript используется метод push(). Например, var arr = [1, 2, 3]; arr.push(4); // [1, 2, 3, 4]

Как удалить последний элемент из массива в JavaScript?
Ответ: Для удаления последнего элемента из массива в JavaScript используется метод pop(). Например, var arr = [1, 2, 3]; arr.pop(); // [1, 2]

Какие методы используются для работы с массивами в JavaScript?
Ответ: В JavaScript для работы с массивами используются методы, такие как push(), pop(), shift(), unshift(), slice(), splice(), concat(), join() и другие.
`
export default str
